// Generated by jextract

package com.littlekt.wgpu;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct WGPUAdapterProperties {
 *     WGPUChainedStructOut *nextInChain;
 *     uint32_t vendorID;
 *     const char *vendorName;
 *     const char *architecture;
 *     uint32_t deviceID;
 *     const char *name;
 *     const char *driverDescription;
 *     WGPUAdapterType adapterType;
 *     WGPUBackendType backendType;
 * }
 * }
 */
public class WGPUAdapterProperties {

    WGPUAdapterProperties() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        WGPU.C_POINTER.withName("nextInChain"),
        WGPU.C_INT.withName("vendorID"),
        MemoryLayout.paddingLayout(4),
        WGPU.C_POINTER.withName("vendorName"),
        WGPU.C_POINTER.withName("architecture"),
        WGPU.C_INT.withName("deviceID"),
        MemoryLayout.paddingLayout(4),
        WGPU.C_POINTER.withName("name"),
        WGPU.C_POINTER.withName("driverDescription"),
        WGPU.C_INT.withName("adapterType"),
        WGPU.C_INT.withName("backendType")
    ).withName("WGPUAdapterProperties");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout nextInChain$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("nextInChain"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WGPUChainedStructOut *nextInChain
     * }
     */
    public static final AddressLayout nextInChain$layout() {
        return nextInChain$LAYOUT;
    }

    private static final long nextInChain$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WGPUChainedStructOut *nextInChain
     * }
     */
    public static final long nextInChain$offset() {
        return nextInChain$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WGPUChainedStructOut *nextInChain
     * }
     */
    public static MemorySegment nextInChain(MemorySegment struct) {
        return struct.get(nextInChain$LAYOUT, nextInChain$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WGPUChainedStructOut *nextInChain
     * }
     */
    public static void nextInChain(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(nextInChain$LAYOUT, nextInChain$OFFSET, fieldValue);
    }

    private static final OfInt vendorID$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vendorID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t vendorID
     * }
     */
    public static final OfInt vendorID$layout() {
        return vendorID$LAYOUT;
    }

    private static final long vendorID$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t vendorID
     * }
     */
    public static final long vendorID$offset() {
        return vendorID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t vendorID
     * }
     */
    public static int vendorID(MemorySegment struct) {
        return struct.get(vendorID$LAYOUT, vendorID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t vendorID
     * }
     */
    public static void vendorID(MemorySegment struct, int fieldValue) {
        struct.set(vendorID$LAYOUT, vendorID$OFFSET, fieldValue);
    }

    private static final AddressLayout vendorName$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("vendorName"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *vendorName
     * }
     */
    public static final AddressLayout vendorName$layout() {
        return vendorName$LAYOUT;
    }

    private static final long vendorName$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *vendorName
     * }
     */
    public static final long vendorName$offset() {
        return vendorName$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *vendorName
     * }
     */
    public static MemorySegment vendorName(MemorySegment struct) {
        return struct.get(vendorName$LAYOUT, vendorName$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *vendorName
     * }
     */
    public static void vendorName(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(vendorName$LAYOUT, vendorName$OFFSET, fieldValue);
    }

    private static final AddressLayout architecture$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("architecture"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *architecture
     * }
     */
    public static final AddressLayout architecture$layout() {
        return architecture$LAYOUT;
    }

    private static final long architecture$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *architecture
     * }
     */
    public static final long architecture$offset() {
        return architecture$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *architecture
     * }
     */
    public static MemorySegment architecture(MemorySegment struct) {
        return struct.get(architecture$LAYOUT, architecture$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *architecture
     * }
     */
    public static void architecture(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(architecture$LAYOUT, architecture$OFFSET, fieldValue);
    }

    private static final OfInt deviceID$LAYOUT = (OfInt)$LAYOUT.select(groupElement("deviceID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t deviceID
     * }
     */
    public static final OfInt deviceID$layout() {
        return deviceID$LAYOUT;
    }

    private static final long deviceID$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t deviceID
     * }
     */
    public static final long deviceID$offset() {
        return deviceID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t deviceID
     * }
     */
    public static int deviceID(MemorySegment struct) {
        return struct.get(deviceID$LAYOUT, deviceID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t deviceID
     * }
     */
    public static void deviceID(MemorySegment struct, int fieldValue) {
        struct.set(deviceID$LAYOUT, deviceID$OFFSET, fieldValue);
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final AddressLayout driverDescription$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("driverDescription"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *driverDescription
     * }
     */
    public static final AddressLayout driverDescription$layout() {
        return driverDescription$LAYOUT;
    }

    private static final long driverDescription$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *driverDescription
     * }
     */
    public static final long driverDescription$offset() {
        return driverDescription$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *driverDescription
     * }
     */
    public static MemorySegment driverDescription(MemorySegment struct) {
        return struct.get(driverDescription$LAYOUT, driverDescription$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *driverDescription
     * }
     */
    public static void driverDescription(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(driverDescription$LAYOUT, driverDescription$OFFSET, fieldValue);
    }

    private static final OfInt adapterType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("adapterType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WGPUAdapterType adapterType
     * }
     */
    public static final OfInt adapterType$layout() {
        return adapterType$LAYOUT;
    }

    private static final long adapterType$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WGPUAdapterType adapterType
     * }
     */
    public static final long adapterType$offset() {
        return adapterType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WGPUAdapterType adapterType
     * }
     */
    public static int adapterType(MemorySegment struct) {
        return struct.get(adapterType$LAYOUT, adapterType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WGPUAdapterType adapterType
     * }
     */
    public static void adapterType(MemorySegment struct, int fieldValue) {
        struct.set(adapterType$LAYOUT, adapterType$OFFSET, fieldValue);
    }

    private static final OfInt backendType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("backendType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WGPUBackendType backendType
     * }
     */
    public static final OfInt backendType$layout() {
        return backendType$LAYOUT;
    }

    private static final long backendType$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WGPUBackendType backendType
     * }
     */
    public static final long backendType$offset() {
        return backendType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WGPUBackendType backendType
     * }
     */
    public static int backendType(MemorySegment struct) {
        return struct.get(backendType$LAYOUT, backendType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WGPUBackendType backendType
     * }
     */
    public static void backendType(MemorySegment struct, int fieldValue) {
        struct.set(backendType$LAYOUT, backendType$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

