// Generated by jextract

package com.littlekt.wgpu;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct WGPUShaderModuleGLSLDescriptor {
 *     WGPUChainedStruct chain;
 *     WGPUShaderStage stage;
 *     const char *code;
 *     uint32_t defineCount;
 *     WGPUShaderDefine *defines;
 * }
 * }
 */
public class WGPUShaderModuleGLSLDescriptor {

    WGPUShaderModuleGLSLDescriptor() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        WGPUChainedStruct.layout().withName("chain"),
        WGPU.C_INT.withName("stage"),
        MemoryLayout.paddingLayout(4),
        WGPU.C_POINTER.withName("code"),
        WGPU.C_INT.withName("defineCount"),
        MemoryLayout.paddingLayout(4),
        WGPU.C_POINTER.withName("defines")
    ).withName("WGPUShaderModuleGLSLDescriptor");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout chain$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("chain"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WGPUChainedStruct chain
     * }
     */
    public static final GroupLayout chain$layout() {
        return chain$LAYOUT;
    }

    private static final long chain$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WGPUChainedStruct chain
     * }
     */
    public static final long chain$offset() {
        return chain$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WGPUChainedStruct chain
     * }
     */
    public static MemorySegment chain(MemorySegment struct) {
        return struct.asSlice(chain$OFFSET, chain$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WGPUChainedStruct chain
     * }
     */
    public static void chain(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, chain$OFFSET, chain$LAYOUT.byteSize());
    }

    private static final OfInt stage$LAYOUT = (OfInt)$LAYOUT.select(groupElement("stage"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WGPUShaderStage stage
     * }
     */
    public static final OfInt stage$layout() {
        return stage$LAYOUT;
    }

    private static final long stage$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WGPUShaderStage stage
     * }
     */
    public static final long stage$offset() {
        return stage$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WGPUShaderStage stage
     * }
     */
    public static int stage(MemorySegment struct) {
        return struct.get(stage$LAYOUT, stage$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WGPUShaderStage stage
     * }
     */
    public static void stage(MemorySegment struct, int fieldValue) {
        struct.set(stage$LAYOUT, stage$OFFSET, fieldValue);
    }

    private static final AddressLayout code$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("code"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *code
     * }
     */
    public static final AddressLayout code$layout() {
        return code$LAYOUT;
    }

    private static final long code$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *code
     * }
     */
    public static final long code$offset() {
        return code$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *code
     * }
     */
    public static MemorySegment code(MemorySegment struct) {
        return struct.get(code$LAYOUT, code$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *code
     * }
     */
    public static void code(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(code$LAYOUT, code$OFFSET, fieldValue);
    }

    private static final OfInt defineCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("defineCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t defineCount
     * }
     */
    public static final OfInt defineCount$layout() {
        return defineCount$LAYOUT;
    }

    private static final long defineCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t defineCount
     * }
     */
    public static final long defineCount$offset() {
        return defineCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t defineCount
     * }
     */
    public static int defineCount(MemorySegment struct) {
        return struct.get(defineCount$LAYOUT, defineCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t defineCount
     * }
     */
    public static void defineCount(MemorySegment struct, int fieldValue) {
        struct.set(defineCount$LAYOUT, defineCount$OFFSET, fieldValue);
    }

    private static final AddressLayout defines$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("defines"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * WGPUShaderDefine *defines
     * }
     */
    public static final AddressLayout defines$layout() {
        return defines$LAYOUT;
    }

    private static final long defines$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * WGPUShaderDefine *defines
     * }
     */
    public static final long defines$offset() {
        return defines$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * WGPUShaderDefine *defines
     * }
     */
    public static MemorySegment defines(MemorySegment struct) {
        return struct.get(defines$LAYOUT, defines$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * WGPUShaderDefine *defines
     * }
     */
    public static void defines(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(defines$LAYOUT, defines$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

